CoreService/US_26_OpenDepositAccountList/README.md

Sample SOAP Request
```
<soapenv:Envelope xmlns:q0="http://service.bni.co.id/core" xmlns:bo="http://service.bni.co.id/core/bo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <q0:transaction>
      <request>
        <systemId>KSEI_AKSES</systemId>
        <content xsi:type="bo:OpenDepositAccountListReq">
          <cifNum>00000009100202500</cifNum>
        </content>
      </request>
    </q0:transaction>
  </soapenv:Body>
</soapenv:Envelope>
```

Sample SOAP Response
```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:dpss0="bons">
   <soapenv:Header/>
   <soapenv:Body>
      <core:transactionResponse xmlns:bo="http://service.bni.co.id/core/bo" xmlns:core="http://service.bni.co.id/core">
         <response>
            <header>
               <coreJournal>237878</coreJournal>
            </header>
            <content xsi:type="bo:CompiledOpenDepositAccountListRes">
               <cifNum>00000009100202500</cifNum>
               <customerName>Bpk FAJAR ARIF FAJAR ARIF BUDIMAN, SE.MM</customerName>
               <keyPerson></keyPerson>
               <noDIN></noDIN>
               <noHP>08129942310</noHP>
               <openDepositAccountInfo>
                  <accountNum>00000000115409526</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>TAPLUS BISNIS PERORANGAN</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>500.892.500,00</balance>
                  <intRate>3.5000</intRate>
                  <matDate/>
                  <accType>2300</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>500.892.500,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409491</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>100.847.136,00</balance>
                  <intRate>2.5000</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>100.847.136,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115410065</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>5.805.340.154,00</balance>
                  <intRate>3.0000</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>5.805.050.154,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115471958</accountNum>
                  <accountStatus>BUKA</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>0,00</balance>
                  <intRate>0.0000</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>0,00</effectiveBalance>
                  <branchCode>0243</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409582</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.762.510,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.762.510,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409480</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>51.983.189,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>51.983.189,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115412096</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>4.964.715,00</balance>
                  <intRate>1.7500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>4.964.715,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115412085</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>7.962.340,00</balance>
                  <intRate>1.7500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>7.962.340,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409548</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.722.997,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.722.997,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409593</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.835.504,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.835.504,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409537</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.901.208,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.901.208,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115410203</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>10.656.307,00</balance>
                  <intRate>2.0000</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>10.656.307,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115410269</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>19.942.581,00</balance>
                  <intRate>2.0000</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>19.942.581,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409559</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.825.497,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.825.497,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409571</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.880.004,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.880.004,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409560</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>BNI TAPLUS</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>50.772.504,00</balance>
                  <intRate>2.2500</intRate>
                  <matDate/>
                  <accType>2000</accType>
                  <subCat>0001</subCat>
                  <effectiveBalance>50.772.504,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115295733</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>GIRO TANPA SO MIN TRX DB TERBT</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>9.900.000,00</balance>
                  <intRate>0.0000</intRate>
                  <matDate/>
                  <accType>1811</accType>
                  <subCat>6101</subCat>
                  <effectiveBalance>9.900.000,00</effectiveBalance>
                  <branchCode>0017</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115408680</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>GIRO OVERDRAFT BERKARTU</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>1.365.000,00</balance>
                  <intRate>0.0000</intRate>
                  <matDate/>
                  <accType>1413</accType>
                  <subCat>5001</subCat>
                  <effectiveBalance>1.365.000,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409195</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>GIRO OVERDRAFT BERKARTU</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>10.770.000,00</balance>
                  <intRate>0.0000</intRate>
                  <matDate/>
                  <accType>1413</accType>
                  <subCat>5001</subCat>
                  <effectiveBalance>10.770.000,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409117</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>GIRO OVERDRAFT BERKARTU</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>4.667.500,00</balance>
                  <intRate>0.0000</intRate>
                  <matDate/>
                  <accType>1413</accType>
                  <subCat>5001</subCat>
                  <effectiveBalance>4.667.500,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115409071</accountNum>
                  <accountStatus>DORM</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>GIRO OVERDRAFT BERKARTU</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>5.717.500,00</balance>
                  <intRate>0.0000</intRate>
                  <matDate/>
                  <accType>1413</accType>
                  <subCat>5001</subCat>
                  <effectiveBalance>5.717.500,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <openDepositAccountInfo>
                  <accountNum>00000000115410565</accountNum>
                  <accountStatus>BUKA</accountStatus>
                  <accountTypeCode></accountTypeCode>
                  <productName>GIRO OVERDRAFT BB PERORANGAN</productName>
                  <currency>IDR</currency>
                  <ownership></ownership>
                  <balance>10.000.000,00</balance>
                  <intRate>1.0000</intRate>
                  <matDate/>
                  <accType>1410</accType>
                  <subCat>5001</subCat>
                  <effectiveBalance>10.000.000,00</effectiveBalance>
                  <branchCode>0259</branchCode>
                  <flagIbank>0</flagIbank>
               </openDepositAccountInfo>
               <curr1>IDR</curr1>
               <totBalance>6.900.709.146,00</totBalance>
            </content>
         </response>
      </core:transactionResponse>
   </soapenv:Body>
</soapenv:Envelope>
```